ziyiz/DIY-Sim-Racing-FFB-Pedal-Customed/ESP32_master/src/Main.cpp
    }
    if(update_extend_state)
    {
      update_extend_state=false;
      Serial.write((char*)&dap_state_extended_st, sizeof(dap_state_extended_st));
      Serial.print("\r\n");

    }
    int pedal_config_IDX=0;
    for(pedal_config_IDX=0;pedal_config_IDX<3;pedal_config_IDX++)
    {
      if(ESPNow_request_config_b[pedal_config_IDX])
      {
        DAP_config_st * dap_config_st_local_ptr;
        DAP_config_st dap_config_st_local;
        if(pedal_config_IDX==0)
        {
          memcpy(&dap_config_st_local, &dap_config_st_Clu, sizeof(DAP_config_st));
          //dap_config_st_local_ptr = &dap_config_st_Clu;
        }
        if(pedal_config_IDX==1)
        {
          memcpy(&dap_config_st_local, &dap_config_st_Brk, sizeof(DAP_config_st));
          //dap_config_st_local_ptr = &dap_config_st_Brk;
        }
        if(pedal_config_IDX==2)
        {
          memcpy(&dap_config_st_local, &dap_config_st_Gas, sizeof(DAP_config_st));
          //dap_config_st_local_ptr = &dap_config_st_Gas;
        }
        dap_config_st_local_ptr= &dap_config_st_local;
        
        //uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_st.payLoadHeader_)), sizeof(dap_config_st.payLoadHeader_) + sizeof(dap_config_st.payLoadPedalConfig_));
        crc = checksumCalculator((uint8_t*)(&(dap_config_st_local.payLoadHeader_)), sizeof(dap_config_st_local.payLoadHeader_) + sizeof(dap_config_st_local.payLoadPedalConfig_));
        //dap_config_st_local_ptr->payloadFooter_.checkSum = crc;
        dap_config_st_local_ptr->payLoadHeader_.PedalTag=dap_config_st_local_ptr->payLoadPedalConfig_.pedal_type;
        Serial.write((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));
        Serial.print("\r\n");
        ESPNow_request_config_b[pedal_config_IDX]=false;
        Serial.print("Pedal:");
        Serial.print(pedal_config_IDX);
        Serial.println("config returned");
        delay(3);
      }
    }

    if(ESPNow_error_b)
    {
      Serial.print("Pedal:");
      Serial.print(dap_state_basic_st.payLoadHeader_.PedalTag);
      Serial.print(" E:");
      Serial.println(dap_state_basic_st.payloadPedalState_Basic_.error_code_u8);
      ESPNow_error_b=false;    
    }
    if(basic_rssi_update)
    {
      int rssi_filter_value=constrain(rssi_filter.process(rssi_display),-100,0) ;
      dap_bridge_state_st.payloadBridgeState_.Pedal_RSSI=(uint8_t)(rssi_filter_value+101);
      dap_bridge_state_st.payLoadHeader_.PedalTag=5; //5 means bridge
      dap_bridge_state_st.payLoadHeader_.payloadType=DAP_PAYLOAD_TYPE_BRIDGE_STATE;
      dap_bridge_state_st.payLoadHeader_.version=DAP_VERSION_CONFIG;
      crc = checksumCalculator((uint8_t*)(&(dap_bridge_state_st.payLoadHeader_)), sizeof(dap_bridge_state_st.payLoadHeader_) + sizeof(dap_bridge_state_st.payloadBridgeState_));
      dap_bridge_state_st.payloadFooter_.checkSum=crc;
      DAP_bridge_state_st * dap_bridge_st_local_ptr;
      dap_bridge_st_local_ptr = &dap_bridge_state_st;
      Serial.write((char*)dap_bridge_st_local_ptr, sizeof(DAP_bridge_state_st));
      Serial.print("\r\n");
      basic_rssi_update=false;
      /*
      if(rssi_filter_value<-88)
      {
        Serial.println("Warning: BAD WIRELESS CONNECTION");
        //Serial.print("Pedal:");
        //Serial.print(dap_state_basic_st.payLoadHeader_.PedalTag);
        Serial.print(" RSSI:");
        Serial.println(rssi_filter_value);  
      }
      */
        #ifdef ESPNow_debug
          Serial.print("Pedal:");
          Serial.print(dap_state_basic_st.payLoadHeader_.PedalTag);
          Serial.print(" RSSI:");
          Serial.println(rssi_filter_value);        
        #endif
        
    }
    uint8_t pedalIDX;
    for(pedalIDX=0;pedalIDX<3;pedalIDX++)
    {
      unsigned long current_time=millis();
      if(dap_bridge_state_st.payloadBridgeState_.Pedal_availability[pedalIDX]==1)
      {
        if(current_time-pedal_last_update[pedalIDX]>3000)
        {
          Serial.print("Pedal:");
          Serial.print(pedalIDX);
          Serial.println(" Disconnected");
          dap_bridge_state_st.payloadBridgeState_.Pedal_availability[pedalIDX]=0;
        }
      }

    }
    if(digitalRead(Pairing_GPIO)==LOW)
    {
      /*
      Serial.println("Boot press");
      delay(1000);
      _ESP_pairing_reg.Pair_status[1]=press_count;
      EEPROM.put(EEPROM_offset,_ESP_pairing_reg);
      EEPROM.commit();
      press_count++;
      if(press_count>254)
      {
        press_count=0;
      }
      Serial.print("Count: ");
      Serial.println(press_count);
      ESP_pairing_reg ESP_pairing_reg_local;
      EEPROM.get(EEPROM_offset, ESP_pairing_reg_local);
      _ESP_pairing_reg=ESP_pairing_reg_local;
      Serial.print("EEPROM Count: ");
      Serial.println(_ESP_pairing_reg.Pair_status[1]); 
      */     
    }
    delay(2);
  }
}

void Joystick_Task( void * pvParameters )
{
  for(;;)
  {   
    #ifdef USB_JOYSTICK
    if(IsControllerReady())
    {
      if(pedal_status==0)
      {
        SetControllerOutputValueAccelerator(pedal_cluth_value);
        SetControllerOutputValueBrake(pedal_brake_value);
        SetControllerOutputValueThrottle(pedal_throttle_value);
        SetControllerOutputValueRudder(0);
        SetControllerOutputValueRudder_brake(0,0);
      }
      if (pedal_status==1)
      {
        SetControllerOutputValueAccelerator(0);
        SetControllerOutputValueBrake(0);
        SetControllerOutputValueThrottle(0);
        //3% deadzone
        if(pedal_brake_value<((int16_t)(0.47*JOYSTICK_RANGE))||pedal_brake_value>((int16_t)(0.53*JOYSTICK_RANGE)))
        {
          SetControllerOutputValueRudder(pedal_brake_value);
        }
        else
        {
          SetControllerOutputValueRudder((int16_t)(0.5*JOYSTICK_RANGE));
        }
        SetControllerOutputValueRudder_brake(0,0);
        
      }
      if (pedal_status==2)
      {
        SetControllerOutputValueAccelerator(0);
        SetControllerOutputValueBrake(0);
        SetControllerOutputValueThrottle(0);
        SetControllerOutputValueRudder((int16_t)(0.5*JOYSTICK_RANGE));
        //int16_t filter_brake=0;
        //int16_t filter_throttle=0;
        
        SetControllerOutputValueRudder_brake(pedal_brake_value,pedal_throttle_value);
        
